#+TITLE: getting apisnoop running on kubernetes
#+PROPERTY: header-args:shell :results output code verbatim replace
#+PROPERTY: header-args:shell+ :dir (concat (file-name-directory buffer-file-name) "../../apps")
#+PROPERTY: header-args:shell+ :prologue "export PS1= ; . .loadenv\nexec 2>&1\n"
#+PROPERTY: header-args:shell+ :epilogue ":\n"
#+PROPERTY: header-args:shell+ :wrap "EXAMPLE :noeval t"
#+NOPROPERTY: header-args:tmate+ :prologue (concat "cd " org-file-dir "\n")

** install
#+NAME: install kompose
#+BEGIN_SRC shell
export KOMPOSE_VERSION=v1.18.0
export KOMPOSE_PATH=$HOME/go/bin/kompose
curl -L https://github.com/kubernetes/kompose/releases/download/${KOMPOSE_VERSION}/kompose-linux-amd64 \
  -o $KOMPOSE_PATH
chmod +x $KOMPOSE_PATH
kompose version
#+END_SRC

#+RESULTS: install kompose
#+begin_EXAMPLE
1.18.0 (06a2e56)
#+end_EXAMPLE

** convert

Let's see what our converted resources look like:

#+NAME: convert
#+BEGIN_SRC shell :dir ../../apps/
(
kompose convert
) 2>&1
:
#+END_SRC

#+RESULTS: convert
#+begin_EXAMPLE
[36mINFO[0m Kubernetes file "hasura-service.yaml" created 
[36mINFO[0m Kubernetes file "postgres-service.yaml" created 
[36mINFO[0m Kubernetes file "hasura-deployment.yaml" created 
[36mINFO[0m Kubernetes file "postgres-deployment.yaml" created 
#+end_EXAMPLE
** get services
#+BEGIN_SRC shell
  kubectl get services
#+END_SRC

#+RESULTS:
#+begin_EXAMPLE
NAME       TYPE        CLUSTER-IP   EXTERNAL-IP   PORT(S)    AGE
hasura     ClusterIP   10.0.5.239   <none>        8080/TCP   51s
postgres   ClusterIP   10.0.5.62    <none>        5432/TCP   51s
#+end_EXAMPLE
** get pods
#+BEGIN_SRC shell
  kubectl get pods
#+END_SRC

#+RESULTS:
#+begin_EXAMPLE
NAME                        READY   STATUS    RESTARTS   AGE
hasura-6787bb79d4-7l78d     1/1     Running   1          57s
postgres-5d4d96f78c-dqzlk   1/1     Running   0          57s
#+end_EXAMPLE
** configure and install 
  #+BEGIN_SRC tmate :session apisnoop:traefik_install
    helm init
    helm repo update
    helm install --values $HOME/ii/apisnoop/apps/traefik.yaml --name ${TRAEFIK_DEPLOYMENT} --namespace ${TRAEFIK_NAMESPACE} stable/traefik
  #+END_SRC

  #+RESULTS:
  #+begin_EXAMPLE
  #+end_EXAMPLE
** helm upgrade in place
#+NAME: helm upgrade in place
#+BEGIN_SRC shell
helm upgrade --values $HOME/ii/apisnoop/apps/traefik.yaml ${TRAEFIK_DEPLOYMENT} stable/traefik
#+END_SRC

#+RESULTS: helm upgrade in place
#+begin_EXAMPLE
Release "ii-traefik" has been upgraded.
LAST DEPLOYED: Fri Aug 30 18:42:17 2019
NAMESPACE: kube-system
STATUS: DEPLOYED

RESOURCES:
==> v1/ClusterRole
NAME        AGE
ii-traefik  13h

==> v1/ClusterRoleBinding
NAME        AGE
ii-traefik  13h

==> v1/ConfigMap
NAME             DATA  AGE
ii-traefik       1     13h
ii-traefik-test  1     13h

==> v1/Deployment
NAME        READY  UP-TO-DATE  AVAILABLE  AGE
ii-traefik  1/1    1           1          13h

==> v1/PersistentVolumeClaim
NAME             STATUS  VOLUME                                    CAPACITY  ACCESS MODES  STORAGECLASS  AGE
ii-traefik-acme  Bound   pvc-08cee985-cae4-11e9-9d36-42010a9800d6  1Gi       RWO           standard      13h

==> v1/Pod(related)
NAME                         READY  STATUS   RESTARTS  AGE
ii-traefik-5d67659bc5-ngcxm  1/1    Running  0         34s

==> v1/Secret
NAME                           TYPE    DATA  AGE
ii-traefik-default-cert        Opaque  2     13h
ii-traefik-dnsprovider-config  Opaque  2     13h

==> v1/Service
NAME                  TYPE          CLUSTER-IP  EXTERNAL-IP    PORT(S)                     AGE
ii-traefik            LoadBalancer  10.0.4.69   35.189.56.228  80:31199/TCP,443:31755/TCP  13h
ii-traefik-dashboard  ClusterIP     10.0.1.227  <none>         80/TCP                      13h

==> v1/ServiceAccount
NAME        SECRETS  AGE
ii-traefik  1        13h

==> v1beta1/Ingress
NAME                  HOSTS                ADDRESS  PORTS  AGE
ii-traefik-dashboard  traefik.apisnoop.io  80       13h


NOTES:

1. Get Traefik's load balancer IP/hostname:

     NOTE: It may take a few minutes for this to become available.

     You can watch the status by running:

         $ kubectl get svc ii-traefik --namespace kube-system -w

     Once 'EXTERNAL-IP' is no longer '<pending>':

         $ kubectl describe svc ii-traefik --namespace kube-system | grep Ingress | awk '{print $3}'

2. Configure DNS records corresponding to Kubernetes ingress resources to point to the load balancer IP/hostname found in step 1

#+end_EXAMPLE

*** traefik service
  #+NAME: get traefik service
  #+BEGIN_SRC shell
    kubectl get svc --namespace=${TRAEFIK_NAMESPACE} ${TRAEFIK_DEPLOYMENT}
  #+END_SRC

  #+RESULTS: get traefik service
  #+begin_EXAMPLE
  NAME         TYPE           CLUSTER-IP   EXTERNAL-IP     PORT(S)                      AGE
  ii-traefik   LoadBalancer   10.0.4.69    35.189.56.228   80:31199/TCP,443:31755/TCP   11h
  #+end_EXAMPLE

*** traefik inbound ip

  #+NAME: traefik inbound IP
  #+BEGIN_SRC shell
  kubectl describe svc --namespace=${TRAEFIK_NAMESPACE} ${TRAEFIK_DEPLOYMENT} | grep Ingress | awk '{print $3}'
  #+END_SRC

  #+RESULTS: traefik inbound IP
  #+begin_EXAMPLE
  35.189.56.228
  #+end_EXAMPLE

**** traefik service list
#+NAME: ii-traefik service list
#+BEGIN_SRC shell
kubectl get services --namespace ${TRAEFIK_NAMESPACE} | grep traefik
#+END_SRC

#+RESULTS: ii-traefik service list
#+begin_EXAMPLE
ii-traefik             LoadBalancer   10.0.4.69     35.189.56.228   80:31199/TCP,443:31755/TCP   12h
ii-traefik-dashboard   ClusterIP      10.0.1.227    <none>          80/TCP                       12h
#+end_EXAMPLE

**** traefik ingress list
#+NAME: traefik ingress list
#+BEGIN_SRC shell
kubectl get ingress --namespace ${TRAEFIK_NAMESPACE} | grep traefik
#+END_SRC

#+RESULTS: traefik ingress list
#+begin_EXAMPLE
ii-traefik-dashboard   traefik.apisnoop.io   35.244.126.62   80      12h
#+end_EXAMPLE

**** traefik-dashboard ingress
#+NAME: traefik-dashboard ingress
#+BEGIN_SRC shell :wrap "SRC yaml"
kubectl get ingress --namespace ${TRAEFIK_NAMESPACE} ${TRAEFIK_DEPLOYMENT}-dashboard -o yaml
#+END_SRC

#+RESULTS: traefik-dashboard ingress
#+begin_SRC yaml
apiVersion: extensions/v1beta1
kind: Ingress
metadata:
  creationTimestamp: "2019-08-30T05:07:16Z"
  generation: 1
  labels:
    app: traefik
    chart: traefik-1.77.1
    heritage: Tiller
    release: ii-traefik
  name: ii-traefik-dashboard
  namespace: kube-system
  resourceVersion: "645092"
  selfLink: /apis/extensions/v1beta1/namespaces/kube-system/ingresses/ii-traefik-dashboard
  uid: 08d9af53-cae4-11e9-9d36-42010a9800d6
spec:
  rules:
  - host: traefik.apisnoop.io
    http:
      paths:
      - backend:
          serviceName: ii-traefik-dashboard
          servicePort: dashboard-http
status:
  loadBalancer:
    ingress:
    - ip: 35.244.126.62
#+end_SRC

#+BEGIN_SRC shell
kubectl api-resources -o wide
#+END_SRC

#+RESULTS:
#+begin_EXAMPLE
NAME                              SHORTNAMES   APIGROUP                       NAMESPACED   KIND                             VERBS
bindings                                                                      true         Binding                          [create]
componentstatuses                 cs                                          false        ComponentStatus                  [get list]
configmaps                        cm                                          true         ConfigMap                        [create delete deletecollection get list patch update watch]
endpoints                         ep                                          true         Endpoints                        [create delete deletecollection get list patch update watch]
events                            ev                                          true         Event                            [create delete deletecollection get list patch update watch]
limitranges                       limits                                      true         LimitRange                       [create delete deletecollection get list patch update watch]
namespaces                        ns                                          false        Namespace                        [create delete get list patch update watch]
nodes                             no                                          false        Node                             [create delete deletecollection get list patch update watch]
persistentvolumeclaims            pvc                                         true         PersistentVolumeClaim            [create delete deletecollection get list patch update watch]
persistentvolumes                 pv                                          false        PersistentVolume                 [create delete deletecollection get list patch update watch]
pods                              po                                          true         Pod                              [create delete deletecollection get list patch update watch]
podtemplates                                                                  true         PodTemplate                      [create delete deletecollection get list patch update watch]
replicationcontrollers            rc                                          true         ReplicationController            [create delete deletecollection get list patch update watch]
resourcequotas                    quota                                       true         ResourceQuota                    [create delete deletecollection get list patch update watch]
secrets                                                                       true         Secret                           [create delete deletecollection get list patch update watch]
serviceaccounts                   sa                                          true         ServiceAccount                   [create delete deletecollection get list patch update watch]
services                          svc                                         true         Service                          [create delete get list patch update watch]
mutatingwebhookconfigurations                  admissionregistration.k8s.io   false        MutatingWebhookConfiguration     [create delete deletecollection get list patch update watch]
validatingwebhookconfigurations                admissionregistration.k8s.io   false        ValidatingWebhookConfiguration   [create delete deletecollection get list patch update watch]
customresourcedefinitions         crd,crds     apiextensions.k8s.io           false        CustomResourceDefinition         [create delete deletecollection get list patch update watch]
apiservices                                    apiregistration.k8s.io         false        APIService                       [create delete deletecollection get list patch update watch]
controllerrevisions                            apps                           true         ControllerRevision               [create delete deletecollection get list patch update watch]
daemonsets                        ds           apps                           true         DaemonSet                        [create delete deletecollection get list patch update watch]
deployments                       deploy       apps                           true         Deployment                       [create delete deletecollection get list patch update watch]
replicasets                       rs           apps                           true         ReplicaSet                       [create delete deletecollection get list patch update watch]
statefulsets                      sts          apps                           true         StatefulSet                      [create delete deletecollection get list patch update watch]
tokenreviews                                   authentication.k8s.io          false        TokenReview                      [create]
localsubjectaccessreviews                      authorization.k8s.io           true         LocalSubjectAccessReview         [create]
selfsubjectaccessreviews                       authorization.k8s.io           false        SelfSubjectAccessReview          [create]
selfsubjectrulesreviews                        authorization.k8s.io           false        SelfSubjectRulesReview           [create]
subjectaccessreviews                           authorization.k8s.io           false        SubjectAccessReview              [create]
horizontalpodautoscalers          hpa          autoscaling                    true         HorizontalPodAutoscaler          [create delete deletecollection get list patch update watch]
cronjobs                          cj           batch                          true         CronJob                          [create delete deletecollection get list patch update watch]
jobs                                           batch                          true         Job                              [create delete deletecollection get list patch update watch]
certificatesigningrequests        csr          certificates.k8s.io            false        CertificateSigningRequest        [create delete deletecollection get list patch update watch]
backendconfigs                                 cloud.google.com               true         BackendConfig                    [delete deletecollection get list patch create update watch]
leases                                         coordination.k8s.io            true         Lease                            [create delete deletecollection get list patch update watch]
daemonsets                        ds           extensions                     true         DaemonSet                        [create delete deletecollection get list patch update watch]
deployments                       deploy       extensions                     true         Deployment                       [create delete deletecollection get list patch update watch]
ingresses                         ing          extensions                     true         Ingress                          [create delete deletecollection get list patch update watch]
networkpolicies                   netpol       extensions                     true         NetworkPolicy                    [create delete deletecollection get list patch update watch]
podsecuritypolicies               psp          extensions                     false        PodSecurityPolicy                [create delete deletecollection get list patch update watch]
replicasets                       rs           extensions                     true         ReplicaSet                       [create delete deletecollection get list patch update watch]
nodes                                          metrics.k8s.io                 false        NodeMetrics                      [get list]
pods                                           metrics.k8s.io                 true         PodMetrics                       [get list]
managedcertificates               mcrt         networking.gke.io              true         ManagedCertificate               [delete deletecollection get list patch create update watch]
networkpolicies                   netpol       networking.k8s.io              true         NetworkPolicy                    [create delete deletecollection get list patch update watch]
poddisruptionbudgets              pdb          policy                         true         PodDisruptionBudget              [create delete deletecollection get list patch update watch]
podsecuritypolicies               psp          policy                         false        PodSecurityPolicy                [create delete deletecollection get list patch update watch]
clusterrolebindings                            rbac.authorization.k8s.io      false        ClusterRoleBinding               [create delete deletecollection get list patch update watch]
clusterroles                                   rbac.authorization.k8s.io      false        ClusterRole                      [create delete deletecollection get list patch update watch]
rolebindings                                   rbac.authorization.k8s.io      true         RoleBinding                      [create delete deletecollection get list patch update watch]
roles                                          rbac.authorization.k8s.io      true         Role                             [create delete deletecollection get list patch update watch]
scalingpolicies                                scalingpolicy.kope.io          true         ScalingPolicy                    [delete deletecollection get list patch create update watch]
priorityclasses                   pc           scheduling.k8s.io              false        PriorityClass                    [create delete deletecollection get list patch update watch]
storageclasses                    sc           storage.k8s.io                 false        StorageClass                     [create delete deletecollection get list patch update watch]
volumeattachments                              storage.k8s.io                 false        VolumeAttachment                 [create delete deletecollection get list patch update watch]
#+end_EXAMPLE
** explores
#+BEGIN_SRC shell
kubectl get ingress --all-namespaces
#+END_SRC

#+RESULTS:
#+begin_EXAMPLE
NAMESPACE     NAME                   HOSTS                   ADDRESS   PORTS   AGE
apisnoop-hh   hasura                 hh-hasura.apisnoop.io             80      20s
kube-system   ii-traefik-dashboard   traefik.apisnoop.io               80      13h
#+end_EXAMPLE

